[net]

width=12
height=12

alpha=0.2 	#momentum
eta=0.001 	#learning rate
rasf=100.0 	#recent average smoothing factor
filters=3

[convolutional]
filters=5
size=4
stride=2
padding=0

[maxpool]
size=2
stride=2

12->

------------


width=20

size=4
stride=2

W=width
F=filter size
P=padding
S=stride
W=(W-F+2P)/S+1

            